Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Std_QueueRequest
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Clears all the queue entries, including the backup stage, for the specified request source.
 *
 * \param[inout] evadcG     Pointer to the EVADC group registers structure.
 * \param[in]    flushQueue Boolean flag to determine whether the queue should be cleared.
 *                          Range: TRUE - Clears the queue.
 *                                 FALSE- Does not clear the queue.
 * \param[in]    sourceType The request source type specifying which queue to clear.
 *                          Range: \ref IfxEvadc_RequestSource.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_clearQueue(Ifx_EVADC_G *evadcG, boolean flushQueue, IfxEvadc_RequestSource sourceType);

/**
 * \brief Starts a queue of a group by generating a trigger event through software.
 *
 * This function initiates the specified queue within the EVADC group, enabling it to
 * process requests based on the selected source type.
 *
 * \param[inout] group      Pointer to the EVADC group.
 * \param[in]    sourceType Request source type specifying which queue to start.
 *                          Range: \ref IfxEvadc_RequestSource.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_startQueue(Ifx_EVADC_G *group, IfxEvadc_RequestSource sourceType);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * brief Add an entry to the queue of a group for the specified channel with the following options set:
 * refill incase of aborted conversion
 * source interrupt enable/disable
 * external trigger control of the aborted conversion
 *
 * \param[inout] group      Pointer to the EVADC group structure.
 * \param[in]    channel    Specifies the channel ID to be added to the queue.
 *                          Range: \ref IfxEvadc_ChannelId
 * \param[in]    sourceType Specifies the request source queue.
 *                          Range: \ref IfxEvadc_RequestSource
 * \param[in]    options    Bitmask specifying the configuration options
 *                          Range: 0 to 0x7EFF
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_addToQueue(Ifx_EVADC_G *group, IfxEvadc_ChannelId channel, IfxEvadc_RequestSource sourceType, uint32 options);

/**
 * \brief Disables the external trigger for a specific queue slot in the EVADC group.
 *
 * \param[inout] evadcG     Pointer to the EVADC group registers structure.
 * \param[in]    sourceType Specifies the request source queue.
 *                          Range: \ref IfxEvadc_RequestSource
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_disableQueueSlotExternalTrigger(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Enables the external trigger for a specific queue slot.
 *
 * \param[inout] evadcG      Pointer to the EVADC group registers structure.
 * \param[in]    sourceType  Specifies the request source queue.
 *                           Range: \ref IfxEvadc_RequestSource
 *
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_enableQueueSlotExternalTrigger(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Gets the requested queue slot gating mode.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_GatingMode The gating mode of the specified queue slot.
 *         Range: \ref IfxEvadc_GatingMode.
 */
IFX_EXTERN IfxEvadc_GatingMode IfxEvadc_getQueueSlotGatingMode(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Retrieves the gating source for a specified request queue slot in the EVADC group.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_GatingSource The gating source configured for the specified queue slot.
 *         Range: \ref IfxEvadc_GatingSource.
 */
IFX_EXTERN IfxEvadc_GatingSource IfxEvadc_getQueueSlotGatingSource(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Retrieves the current priority level of a specific request source queue slot.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers structure.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_RequestSlotPriority The priority level of the specified queue slot.
 *         Range: \ref IfxEvadc_RequestSlotPriority.
 */
IFX_EXTERN IfxEvadc_RequestSlotPriority IfxEvadc_getQueueSlotPriority(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Retrieves the requested queue slot start mode for the specified source type.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_RequestSlotStartMode The configured start mode for the specified queue slot.
 *         Range: \ref IfxEvadc_RequestSlotStartMode.
 */
IFX_EXTERN IfxEvadc_RequestSlotStartMode IfxEvadc_getQueueSlotStartMode(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Retrieves the trigger input for a specified queue slot request source.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_TriggerSource The trigger input corresponding to the specified queue slot.
 *         Range: \ref IfxEvadc_TriggerSource.
 */
IFX_EXTERN IfxEvadc_TriggerSource IfxEvadc_getQueueSlotTriggerInput(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Retrieves the trigger mode configuration for a specified request queue slot in the EVADC group.
 *
 * This function allows the user to query the trigger mode that has been configured for a specific request queue slot.
 * The trigger mode determines how the conversion in the specified queue slot is triggered.
 *
 * \param[in] evadcG      Pointer to the EVADC group registers.
 * \param[in] sourceType  Specifies the request source queue.
 *                        Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_TriggerMode The trigger mode configuration for the specified queue slot.
 *         Range: \ref IfxEvadc_TriggerMode.
 */
IFX_EXTERN IfxEvadc_TriggerMode IfxEvadc_getQueueSlotTriggerMode(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Gives the status of the Queue of a group by returning non zero value if the Queue is full
 *
 * \param[in] group      Pointer to the EVADC group structure.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval IfxEvadc_Status, status of the Queue
 *         Range: \ref IfxEvadc_Status
 *
 * \code
 * Ifx_EVADC_G* group = &MODULE_EVADC.G[0]; // for group 0
 * boolean queueFull = (IfxEvadc_getQueueStatus(group)==IfxEvadc_Status_queueFull)?TRUE:FALSE; // get Queue status for group 0
 * \endcode
 *
 */
IFX_EXTERN IfxEvadc_Status IfxEvadc_getQueueStatus(Ifx_EVADC_G *group, IfxEvadc_RequestSource sourceType);

/**
 * \brief Returns the queue slot requested status.
 *
 * \param[in] evadcG     Pointer to the EVADC group registers.
 * \param[in] sourceType Specifies the request source queue.
 *                       Range: \ref IfxEvadc_RequestSource
 *
 * \retval TRUE  If the specified queue slot request is enabled.
 *         FALSE If the specified queue slot request is disabled.
 */
IFX_EXTERN boolean IfxEvadc_isRequestQueueSlotEnabled(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource sourceType);

/**
 * \brief Configures the gating settings for a specific queue slot.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    gatingSource Gate input selection for the group.
 *                            Range: \ref IfxEvadc_GatingSource
 * \param[in]    gatingMode   Gating mode selection.
 *                            Range: \ref IfxEvadc_GatingMode
 * \param[in]    sourceType   Specifies the request source queue.
 *                            Range: \ref IfxEvadc_RequestSource
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_setQueueSlotGatingConfig(Ifx_EVADC_G *evadcG, IfxEvadc_GatingSource gatingSource, IfxEvadc_GatingMode gatingMode, IfxEvadc_RequestSource sourceType);

/**
 * \brief Sets the trigger operating configurations for the EVADC group.
 *
 * This function configures the trigger mode, trigger source, and request source type
 * for the specified EVADC group. It allows setting up the trigger events based on
 * rising, falling, or any edge, and selects the appropriate trigger source and
 * request source type for the queue slot.
 *
 * \param[inout] evadcG         Pointer to the EVADC group registers.
 * \param[in]    triggerMode    Trigger mode selection.
 *                              Range: \ref IfxEvadc_TriggerMode
 * \param[in]    triggerSource  Trigger input source selection.
 *                              Range: \ref IfxEvadc_TriggerSource
 * \param[in]    sourceType     Specifies the request source queue.
 *                              Range: \ref IfxEvadc_RequestSource
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_setQueueSlotTriggerOperatingConfig(Ifx_EVADC_G *evadcG, IfxEvadc_TriggerMode triggerMode, IfxEvadc_TriggerSource triggerSource, IfxEvadc_RequestSource sourceType);

