Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Std_IO
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Initializes and configures an EMUX output pin with specified mode settings.
 *
 * \param[inout] emux        Pointer to the EMUX pin configuration to be initialized.
 * \param[in]    outputMode  The output mode to be configured for the EMUX pin.
 *                           Range: \ref IfxPort_OutputMode
 * \param[in]    padDriver   The pad driver mode to be configured for the EMUX pin.
 *                           Range: \ref IfxPort_PadDriver
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_initEmuxPin(const IfxEvadc_Emux_Out *emux, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver);

/**
 * \brief Initializes a GxBFL output pin with the specified output mode and pad driver settings.
 *
 * \param[inout] gxBfl The   GxBFL pin to be configured.
 * \param[in]    outputMode  The output mode to be configured for the EMUX pin.
 *                           Range: \ref IfxPort_OutputMode
 * \param[in]    padDriver   The pad driver mode to be configured for the EMUX pin.
 *                           Range: \ref IfxPort_PadDriver
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_initGxBflPin(const IfxEvadc_GxBfl_Out *gxBfl, IfxPort_OutputMode outputMode, IfxPort_PadDriver padDriver);

/** \} */

/** \addtogroup IfxLld_Evadc_Std_Frequency
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Calculates the sample time based on the given analog frequency and sample time.
 *
 * \param[in] analogFrequency  The analog frequency in Hz.
 * \param[in] sampleTime       The sample time in seconds.
 *
 * \retval uint32 The calculated sample time in seconds as an unsigned 32-bit integer.
 *         Range: 0 to 0xFFFF FFFF
 */
IFX_INLINE uint32 IfxEvadc_calculateSampleTime(float32 analogFrequency, float32 sampleTime);

/**
 * \brief Retrieves the configured Fadci EVADC analog clock frequency in Hz.
 *
 * \param[in] group Pointer to the EVADC group structure.
 *
 * \retval The configured Fadci EVADC analog clock frequency in Hz.
 */
IFX_INLINE float32 IfxEvadc_getAdcAnalogFrequency(Ifx_EVADC_G *group);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Gets the configured Fadcd EVADC digital clock frequency in Hz.
 *
 * \param[in] evadc Pointer to the base of EVADC registers.
 *
 * \retval float32 The configured Fadcd EVADC digital clock frequency in Hz.
 */
IFX_EXTERN float32 IfxEvadc_getAdcDigitalFrequency(Ifx_EVADC *evadc);

/** \} */

/** \addtogroup IfxLld_Evadc_Std_Group
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief sets the analog clock synchronization delay for a specific group of the EVADC module
 *
 * \param[inout]  evadcG  Pointer to the EVADC group registers.
 * \param[in]     group   Group No.
 *                        Range: \ref IfxEvadc_GroupId
 * \param[in]     delay   Selects an additional clock cycle for the conversion step of the MSB
 *                        Range: \ref IfxEvadc_AnalogClockSynchronizationDelay
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setAnalogClockSynchronizationDelay(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_AnalogClockSynchronizationDelay delay);

/**
 * \brief Configures the calibration sample time for the specified EVADC group.
 *
 * \param[inout] evadcG Pointer to EVADC SFRs of a particular group.
 * \param[in]    group  Group number to configure.
 *                      Range: \ref IfxEvadc_GroupId
 * \param[in]    mode   Calibration sample time control.
 *                      Range: \ref IfxEvadc_CalibrationSampleTimeControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setCalibrationSampleTime(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_CalibrationSampleTimeControl mode);

/**
 * \brief Clears all pending result requests for the specified EVADC group.
 *
 * \param[inout] evadcG  Pointer to the EVADC group registers.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_clearAllResultRequests(Ifx_EVADC_G *evadcG);

/**
 * \brief Retrieves the noise reduction mode configured for the specified EVADC input class group.
 *
 * \param[in] evadcG        Pointer to the EVADC group registers.
 * \param[in] inputClassNum The input class number for which to retrieve the noise reduction level.
 *                           Range: 0 and 1
 *
 * \retval IfxEvadc_ChannelNoiseReduction The noise reduction mode configured for the input class group.
 *         Range: \ref IfxEvadc_ChannelNoiseReduction.
 */
IFX_INLINE IfxEvadc_ChannelNoiseReduction IfxEvadc_getGroupConversionMode(Ifx_EVADC_G *evadcG, uint8 inputClassNum);

 /**
 * \brief Retrieves conversion results for a specific EVADC group.
 *
 * This function fetches the conversion results for a specified number of channels
 * in the EVADC group and stores them in the provided results array starting from
 * the given offset.
 *
 * \param[in]    group        Pointer to the EVADC group structure containing the configuration
 * \param[inout] results      Pointer to the array where the conversion results will be stored.
 * \param[in]    resultOffset Offset in the results array where the first result will be stored.
 *                            Range: 0 to 0xFF
 * \param[in]    numResults   Number of results to retrieve from the group.
 *                            Range: 0 to 0xFF
 *
 * \retval None
 *
 * \code
 * Here,Three channels are used for queued transfers
 * \code
 *
 * unsigned savedGate = adcGroup.module.evadc->G[adcGroup.groupId].Queue0.QMR0.B.ENGT;
 *
 * // IMPORTANT: for deterministic results we have to disable the queue gate
 * // while filling the queue, otherwise results could be output in the wrong order
 * adcGroup.module.evadc->G[adcGroup.groupId].Queue0.QMR0.B.ENGT = 0;
 *
 * // create channel config
 * IfxEvadc_Adc_ChannelConfig adcChannelConfig[3];
 * IfxEvadc_Adc_Channel adcChannel[3];
 *
 * for(int chnIx=0; chnIx<3; ++chnIx) {
 * IfxEvadc_Adc_initChannelConfig(&adcChannelConfig[chnIx], &adcGroup);
 *
 * adcChannelConfig[chnIx].channelId = (IfxEvadc_ChannelId)(chnIx);
 * adcChannelConfig[chnIx].resultRegister = IfxEvadc_ChannelResult_1; // use result register #1 for all channels
 *
 * // initialize the channel
 * IfxEvadc_Adc_initChannel(&adcChannel[chnIx], &adcChannelConfig[chnIx]);
 *
 * // Add channel to queue with refill enabled
 * IfxEvadc_Adc_addToQueue(&adcChannel[chnIx], IfxEvadc_RequestSource_queue0, IFXEVADC_QUEUE_REFILL);
 *
 * // restore previous gate config
 * adcGroup.module.evadc->G[adcGroup.groupId].Queue0.QMR0.B.ENGT = savedGate;
 *
 * // start the Queue
 * IfxEvadc_Adc_startQueue(&adcGroup,IfxEvadc_RequestSource_queue0); // just for the case that somebody copy&pastes the code - the queue has already been started in previous test
 *
 * Ifx_EVADC_G_RES results[10];
 * result = IfxEvadc_getGroupResult(group, results, 0, 2);
 * \endcode
 *
 */
IFX_INLINE void IfxEvadc_getGroupResult(Ifx_EVADC_G *group, Ifx_EVADC_G_RES *results, uint32 resultOffset, uint32 numResults);

/**
 * \brief Gets the EVADC input class channel sample time.
 *
 * This function calculates the sample time for a specific ADC input class channel based on the provided parameters.
 *
 * \param[in] evadcG          Pointer to the EVADC group registers.
 * \param[in] inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                           Range: 0 and 1
 * \param[in] analogFrequency ADC module analog frequency in Hz.
 *
 * \retval float32 ADC input class channel sample time in seconds.
 */
IFX_INLINE float32 IfxEvadc_getGroupSampleTime(Ifx_EVADC_G *evadcG, uint8 inputClassNum, float32 analogFrequency);

/**
 * \brief Retrieves the configured master index for the EVADC group.
 *
 * \param[in] evadcG Pointer to the EVADC group registers.
 *
 * \retval uint8 The configured master kernel index.
 *         Range: 0 to 3
 */
IFX_INLINE uint8 IfxEvadc_getMasterIndex(Ifx_EVADC_G *evadcG);

/**
 * \brief Selects the idle precharge level for the EVADC group.
 *
 * \param[inout] evadcG  Pointer to the EVADC group registers.
 * \param[in]    group   Group identifier for the EVADC instance to configure.
 *                       Range: \ref IfxEvadc_GroupId
 * \param[in]    mode    Idle precharge mode
 *                       Range: \ref IfxEvadc_IdlePrecharge
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_selectIdlePrechargeLevel(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_IdlePrecharge mode);

/**
 * \brief Enables the input buffer for the specified EVADC group.
 *
 * \param[inout] evadcG  Pointer to the EVADC group registers.
 * \param[in]    group   Group identifier for the EVADC instance to configure.
 *                       Range: \ref IfxEvadc_GroupId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableInputBuffer(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group);

/**
 * \brief Configures the reference precharge duration for the specified EVADC group.
 *
 * \param[inout] evadcG   Pointer to EVADC SFRs of a particular group
 * \param[in]    group    Group identifier for the EVADC instance to configure.
 *                        Range: \ref IfxEvadc_GroupId
 * \param[in]    duration Selects the amount of time for reference input precharging
 *                        Group identifier for the EVADC instance to configure.
 *                       Range: \ref IfxEvadc_ReferencePrechargeControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setReferencePrechargeDuration(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_ReferencePrechargeControl duration);

/**
 * \brief Enables the reference precharge for the specified EVADC group.
 *
 * \param[inout] evadcG Pointer to EVADC SFRs of a particular group.
 * \param[in]    group  Group identifier for the EVADC instance to configure.
 *                      Range: \ref IfxEvadc_GroupId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableReferencePrecharge(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group);

/**
 * \brief Resets the ADC group to its initial state.
 *
 * \param[inout] evadcG Pointer to EVADC SFRs of a particular group.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_resetGroup(Ifx_EVADC_G *evadcG);

/**
 * \brief Configures the sample synchronization mode for the specified EVADC group.
 * 
 * \param[inout] evadcG Pointer to EVADC SFRs of a particular group.
 * \param[in]    group  Group identifier for the EVADC instance to configure.
 *                      Range: \ref IfxEvadc_GroupId
 * \param[in]    mode   The sample synchronization mode to be configured.
 *                      Range: \ref IfxEvadc_SampleSynchronization
 * 
 * \retval None
 */
IFX_INLINE void IfxEvadc_setSampleSynchronizationMode(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_SampleSynchronization mode);

/**
 * \brief Selects an additional clock cycle for the conversion step of the MSB.
 *
 * \param[inout] evadcG Pointer to EVADC SFRs of a particular group.
 * \param[in]    group  Group identifier for the EVADC instance to configure.
 *                      Range: \ref IfxEvadc_GroupId
 * \param[in]    mode   Selects the MSB conversion time in terms of t_ADC.
 *                      Range: \ref IfxEvadc_MsbConversionTime
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_selectDoubleClockForMSBConversion(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_MsbConversionTime mode);

/**
 * \brief Sets the analog converter mode for the specified EVADC group.
 *
 * \param[inout] evadcG               Pointer to the EVADC group registers.
 * \param[in]    analogConverterMode  The mode to be set for the analog converter.
 *                                    Range: \ref IfxEvadc_AnalogConverterMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setAnalogConvertControl(Ifx_EVADC_G *evadcG, IfxEvadc_AnalogConverterMode analogConverterMode);

/**
 * \brief Configures the precharge control for the analog input EMUX of the EVADC group.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    inputClassNum The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in]    mode          Precharge control mode to be set.
 *                             Range: \ref IfxEvadc_AnalogInputPrechargeControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setAnalogInputPrechargeControlEMUX(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_AnalogInputPrechargeControl mode);

/**
 * \brief Configures the analog input precharge control for standard conversions.
 *
 * \param[inout] evadcG        Pointer to the EVADC group's SFR structure.
 * \param[in]    inputClassNum The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in]    mode          Precharge control mode to be set.
 *                             Range: \ref IfxEvadc_AnalogInputPrechargeControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setAnalogInputPrechargeControlStandard(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_AnalogInputPrechargeControl mode);

/**
 * \brief Sets the conversion mode for the specified ADC input class channel group.
 * 
 * \param[inout] evadcG         Pointer to the EVADC group registers.
 * \param[in]    inputClassNum  The input class number for which to retrieve the noise reduction level.
 *                              Range: 0 and 1
 * \param[in]    conversionMode Conversion mode to be set for the input class channel.
 *                              Range: \ref IfxEvadc_ChannelNoiseReduction
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGroupConversionMode(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_ChannelNoiseReduction conversionMode);

/**
 * \brief Sets the conversion mode for EMUX conversions in the specified EVADC group.
 *
 * \param[inout] evadcG         Pointer to the EVADC group's Special Function Registers (SFRs).
 * \param[in]    inputClassNum  The input class number for which to retrieve the noise reduction level.
 *                              Range: 0 and 1
 * \param[in]    conversionMode The desired conversion mode for noise reduction.
 *                              Range: \ref IfxEvadc_ChannelNoiseReductionEMUX
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGroupConversionModeEMUX(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_ChannelNoiseReductionEMUX conversionMode);

/**
 * \brief Configures the sample time for a specific ADC input class group.
 *
 * \param[inout] evadcG           Pointer to the EVADC group registers.
 * \param[in]    inputClassNum    The input class number for which to retrieve the noise reduction level.
 *                                Range: 0 and 1
 * \param[in]    analogFrequency  ADC analog frequency in Hz.
 * \param[in]    sampleTime       Requested sample time in seconds
 * 
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGroupSampleTime(Ifx_EVADC_G *evadcG, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/**
 * \brief Sets the additional number of cycles (in addition to 2) in the sample time for the EVADC group.
 *
 * \param[inout] evadcG          Pointer to the EVADC group's Special Function Registers (SFRs).
 * \param[in]    inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                               Range: 0 and 1
 * \param[in]    analogFrequency ADC analog frequency in Hz.
 * \param[in]    sampleTime      Requested sample time in seconds for the input class.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGroupSampleTimeEMUX(Ifx_EVADC_G *evadcG, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/**
 * \brief Configures the master index for the EVADC group.
 *
 * \param[inout] evadcG      Pointer to the EVADC group registers.
 * \param[in]    masterIndex Master index value to be set.
 *                           Range:  0 to 3
 *
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setMasterIndex(Ifx_EVADC_G *evadcG, uint8 masterIndex);

/**
 * \brief Configures the spread early sample point and EMUX conversions for a specific input class.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    inputClassNum The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in]    mode          Mode of operation for spread early sample point and EMUX conversions.
 *                             Range: \ref IfxEvadc_SpreadEarlySamplePointEMUXConversionsMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_spreadEarlySamplePointEMUXConversions(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_SpreadEarlySamplePointEMUXConversionsMode mode);

/**
 * \brief Configures the spread early sample point standard conversions for the EVADC group.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    inputClassNum The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in]    mode          Mode of spread early sample point standard conversions.
 *                             Range: \ref IfxEvadc_SpreadEarlySamplePointStandardConversionsMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_spreadEarlySamplePointStandardConversions(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_SpreadEarlySamplePointStandardConversionsMode mode);

/**
 * \brief Sets group-specific boundary values for the EVADC group.
 *
 * \param[inout] evadcG Pointer to the EVADC group registers.
 * \param[in]    bound0 Boundary 0 value
 *                      Range: 0 to 0xFFF
 * \param[in]    bound1 Boundary 1 value
 *                      Range: 0 to 0xFFF
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGroupBoundary(Ifx_EVADC_G *evadcG, uint16 bound0, uint16 bound1);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Sets the Arbiter slot configurations for the EVADC group.
 *
 * \param[inout] evadcG     Pointer to the EVADC group registers.
 * \param[in]    slotEnable Enable or disable the slot.
 *                          Range: TRUE: Enable the slot.
 *                                 FALSE: Disable the slot.
 * \param[in]    prio       The priority level of the request slot.
 *                          Range: \ref IfxEvadc_RequestSlotPriority
 * \param[in]    mode       The start mode of the request slot.
 *                          Range: \ref IfxEvadc_RequestSlotStartMode
 * \param[in]    slot       The request source slot to configure.
 *                          Range: \ref IfxEvadc_RequestSource
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_setArbiterPriority(Ifx_EVADC_G *evadcG, boolean slotEnable, IfxEvadc_RequestSlotPriority prio, IfxEvadc_RequestSlotStartMode mode, IfxEvadc_RequestSource slot);

