Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Std_Module
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Disables the EVADC module by resetting it and stopping conversions.
 *
 * \param[inout] evadc  Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disableModule(Ifx_EVADC *evadc);

/**
 * \brief Disables or enables the post calibration for the specified EVADC group.
 *
 * \param[inout] evadcG  Pointer to the base of EVADC group registers.
 * \param[in]    group   Group identifier for the EVADC instance to configure.
 *                       Range: \ref IfxEvadc_GroupId
 * \param[in]    enabled Boolean flag to disable (FALSE) or enable (TRUE) the post calibration.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disablePostCalibration(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, boolean enabled);

/**
 * \brief Enables the EVADC kernel module.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableModule(Ifx_EVADC *evadc);

/**
 * \brief Gets the active state of the ADC calibration for a specified calibration group.
 *
 * \param[in] evadc          Pointer to the base of EVADC module.
 * \param[in] adcCalGroupNum ADC CAL group number to query.
 *                           Range: 0 to 11
 *
 * \retval uint8 CAL group status. The value indicates whether the calibration is active (1) or inactive (0).
 *         Range: 0 - calibration is inactive.
 *                1 - calibration is active.
 */
IFX_INLINE uint8 IfxEvadc_getAdcCalibrationActiveState(Ifx_EVADC *evadc, uint8 adcCalGroupNum);

/**
 * \brief Retrieves the current global configuration value of the EVADC module.
 *
 * \param[in] evadc  Pointer to the base of EVADC module.
 *
 * \retval Ifx_EVADC_GLOBCFG The global control configuration value.
 */
IFX_INLINE Ifx_EVADC_GLOBCFG IfxEvadc_getGlobalConfigValue(Ifx_EVADC *evadc);

/**
 * \brief Retrieves the SRC source address for the specified group and source number.
 *
 * \param[in] group  Group identifier for the EVADC instance to configure.
 *                   Range: \ref IfxEvadc_GroupId
 * \param[in] index  SRC number.
 *                   Range: \ref IfxEvadc_SrcNr
 *
 * \retval Ifx_SRC_SRCR* Pointer to the SRC source register for the specified group and source number.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEvadc_getSrcAddress(IfxEvadc_GroupId group, IfxEvadc_SrcNr index);

/**
 * \brief Checks the status of the startup calibration for the EVADC module.
 *
 * \param[in] evadc Pointer to the base of EVADC module.
 *
 * \retval TRUE  If startup calibration is enabled.
 *         FALSE If startup calibration is disabled.
 */
IFX_INLINE boolean IfxEvadc_getStartupCalibrationStatus(Ifx_EVADC *evadc);

/**
 * \brief Initialises the ADC converter clock.
 *
 * \param[in]    evadc                  Pointer to the base of EVADC module.
 * \param[inout] evadcG                 Pointer to the base of EVADC group registers.
 * \param[in]    converterClockDivider  The clock divider factor for the ADC converter clock.
 *                                      Range: \ref IfxEvadc_ClockDividerFactor
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_initialiseAdcConverterClock(Ifx_EVADC *evadc, Ifx_EVADC_G *evadcG, IfxEvadc_ClockDividerFactor converterClockDivider);

/**
 * \brief Initiates the startup calibration process for the EVADC module.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_initiateStartupCalibration(Ifx_EVADC *evadc);

/**
 * \brief Checks if the EVADC module is currently in a suspended state.
 *
 * \param[in] evadc Pointer to the base of EVADC module.
 *
 * \retval TRUE  Module is suspended.
 *         FALSE Module is not suspended.
 */
IFX_INLINE boolean IfxEvadc_isModuleSuspended(Ifx_EVADC *evadc);

/**
 * \brief Sets the global conversion mode for the specified input class.
 *
 * \param[inout] evadc          Pointer to the base of EVADC module.
 * \param[in]    InputClassNum  The input class number for which to retrieve the noise reduction level.
 *                              Range: 0 to 0x11
 * \param[in]    conversionMode ADC conversion mode.
 *                              Range: \ref IfxEvadc_ChannelNoiseReduction
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setGlobalConversionMode(Ifx_EVADC *evadc, uint8 InputClassNum, IfxEvadc_ChannelNoiseReduction conversionMode);

/**
 * \brief Sets the sensitivity of the module to the sleep signal.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 * \param[in]    mode  The mode of operation for sleep signal sensitivity.
 *                     Range: \ref IfxEvadc_SleepMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setSleepMode(Ifx_EVADC *evadc, IfxEvadc_SleepMode mode);

/** \brief Configure the Module to Hard/Soft suspend mode.
 *
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 * \param[in]    mode  Module suspend mode
 *                     Range: \ref IfxEvadc_SuspendMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setSuspendMode(Ifx_EVADC *evadc, IfxEvadc_SuspendMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Disables write access to the specified EVADC configuration/control registers.
 *
 * \param[inout] evadc         Pointer to the base of EVADC module.
 * \param[in]    protectionSet Index of the bit in the ACCPROTx {x=0/1} for which write access is to be enabled.
 *                             Range: \ref IfxEvadc_Protection
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_disableAccess(Ifx_EVADC *evadc, IfxEvadc_Protection protectionSet);

/**
 * \brief Enables write access to the EVADC configuration and control registers.
 *
 * \param[inout] evadc         Pointer to the base of EVADC module.
 * \param[in]    protectionSet Index of the bit in the ACCPROTx {x=0/1} for which write access is to be enabled.
 *                             Range: \ref IfxEvadc_Protection
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_enableAccess(Ifx_EVADC *evadc, IfxEvadc_Protection protectionSet);

/**
 * \brief Gets the ADC module frequency in Hz.
 *
 * \param[in] evadc  Pointer to the base of EVADC module.
 *
 * \retval float32 The ADC module frequency in Hz.
 */
IFX_EXTERN float32 IfxEvadc_getAdcModuleFrequency(Ifx_EVADC *evadc);

/**
 * \brief Initializes and configures the ADC analog clock with a specified frequency.
 *
 * \param[in]    evadc  Pointer to the base of EVADC module.
 * \param[in]    fAdcI  ADC analog clock frequency in Hz.
 *                      Range: 0 to 0xFFFF FFFF
 * \param[inout] group  Pointer to the base of EVADC group registers.
 *
 * \retval uint32 The configured ADC analog clock frequency in Hz.
 *         Range: 0 to 0xFFFF FFFF.
 */
IFX_EXTERN uint32 IfxEvadc_initializeFAdcI(Ifx_EVADC *evadc, uint32 fAdcI, Ifx_EVADC_G *group);

/**
 * \brief Resets the EVADC module to its initial state.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_resetModule(Ifx_EVADC *evadc);

/**
 * \brief Starts ADC calibration and waits for the end of the calibration process.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_startupCalibration(Ifx_EVADC *evadc);

/**
 * \brief SW workaround for EVADC Master/Slave conversion jitter issue (MCMETILLD-910).
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval TRUE  No failure detected in the activation states.
 *         FALSE Failure detected in either or both activation states.
 */
IFX_EXTERN boolean IfxEvadc_syncConvWorkAround(Ifx_EVADC *evadc);

