Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Std_Channel
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Clears the request for the specified EVADC channel.
 *
 * \param[inout] evadcG    Pointer to the base of EVADC group registers.
 * \param[in]    channelId Specifies the channel ID to be added to the queue.
 *                         Range: \ref IfxEvadc_ChannelId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_clearChannelRequest(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelId);

/**
 * \brief Enables the FIFO mode for the specified channel result register of the EVADC group.
 *
 * \param[inout] evadcG         Pointer to the base of EVADC group registers.
 * \param[in]    resultRegister Channel result register to configure.
 *                              Range: \ref IfxEvadc_ChannelResult
 * \param[in]    fifoMode       FIFO mode to enable.
 *                              Range: \ref IfxEvadc_FifoMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableFifoMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister, IfxEvadc_FifoMode fifoMode);

/**
 * \brief Enables a service request for the specified channel result register in the EVADC group.
 *
 * \param[inout] evadcG         Pointer to the base of EVADC group registers.
 * \param[in]    resultRegister Channel result register to configure.
 *                              Range: \ref IfxEvadc_ChannelResult
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableServiceRequest(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister);

/**
 * \brief Disables the service request for the specified channel result register in the EVADC module.
 *
 * \param[inout] evadcG         Pointer to the base of EVADC group registers.
 * \param[in]    resultRegister Channel result register to configure.
 *                              Range: \ref IfxEvadc_ChannelResult
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disableServiceRequest(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister);

/**
 * \brief Retrieves the current control configuration for a specified EVADC channel.
 *
 * \param[in] evadcG        Pointer to the base of EVADC group registers.
 * \param[in] channelIndex  Specifies the channel ID to be added to the queue.
 *                          Range: \ref IfxEvadc_ChannelId
 *
 * \retval Ifx_EVADC_G_CHCTR The current control configuration of the specified EVADC channel.
 */
IFX_INLINE Ifx_EVADC_G_CHCTR IfxEvadc_getChannelControlConfig(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex);

/**
 * \brief Retrieves the input class configuration for the specified EVADC channel.
 *
 * \param[in] evadcG       Pointer to the base of EVADC group registers.
 * \param[in] channelIndex Specifies the channel ID to be added to the queue.
 *                         Range: \ref IfxEvadc_ChannelId
 *
 * \retval IfxEvadc_InputClasses The input class of the specified channel.
 */
IFX_INLINE IfxEvadc_InputClasses IfxEvadc_getChannelInputclass(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex);

/**
 * \brief Provides a pointer to the channel result service request node 0.
 *
 * \param[in] evadcG Pointer to the base of EVADC group registers.
 *
 * \retval Ifx_EVADC_G_REVNP0 Pointer to the channel result service request node 0.
 */
IFX_INLINE Ifx_EVADC_G_REVNP0 IfxEvadc_getChannelResultServiceRequestNodePointer0(Ifx_EVADC_G *evadcG);

/**
 * \brief Retrieves the channel result service request node pointer 1 for the EVADC group.
 *
 * \param[in] evadcG Pointer to the base of EVADC group registers.
 *
 * \retval The channel result service request node pointer 1
 */
IFX_INLINE Ifx_EVADC_G_REVNP1 IfxEvadc_getChannelResultServiceRequestNodePointer1(Ifx_EVADC_G *evadcG);

/**
 * \brief Retrieves the channel service request node pointer for channel 0.
 *
 * \param[in] evadcG Pointer to the base of EVADC group registers.
 *
 * \retval Ifx_EVADC_G_CEVNP0 Pointer to the service request node for channel 0.
 */
IFX_INLINE Ifx_EVADC_G_CEVNP0 IfxEvadc_getChannelServiceRequestNodePointer0(Ifx_EVADC_G *evadcG);

#if !defined(DEVICE_TC33XED) && !defined (DEVICE_TC35X)
/**
 * \brief Retrieves the channel service request node pointer for channels CH8 to CH15.
 *
 * \param[in] evadcG Pointer to the base of EVADC group registers.
 *
 * \retval Ifx_EVADC_G_CEVNP1 Channel service request node pointer for CH8 to CH15.
 */
IFX_INLINE Ifx_EVADC_G_CEVNP1 IfxEvadc_getChannelServiceRequestNodePointer1(Ifx_EVADC_G *evadcG);
#endif

/**
 * \brief Configures the boundary extension mode for the specified EVADC channel.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelIndex Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 * \param[in]    boundaryMode Specifies the boundary extension mode to be applied to the channel.
 *                            Range: \ref IfxEvadc_BoundaryExtension
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setBoundaryMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_BoundaryExtension boundaryMode);

/**
 * \brief Sets the channel event service request line for the specified EVADC group and channel.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelSrcNr Service request node number to be assigned to the channel.
 *                            Range: \ref IfxEvadc_SrcNr
 * \param[in]    channel      Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setChannelEventNodePointer0(Ifx_EVADC_G *evadcG, IfxEvadc_SrcNr channelSrcNr, IfxEvadc_ChannelId channel);

#if !defined(DEVICE_TC33XED) && !defined (DEVICE_TC35X)
/**
 * \brief Sets the channel event node pointer for channels 8 to 15.
 *
 * This function configures the specified channel to use a specific service request node.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelSrcNr Service request node number to be assigned to the channel.
 *                            Range: \ref IfxEvadc_SrcNr
 * \param[in]    channel      Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setChannelEventNodePointer1(Ifx_EVADC_G *evadcG, IfxEvadc_SrcNr channelSrcNr, IfxEvadc_ChannelId channel);
#endif

/**
 * \brief Configures the input class for a specified EVADC channel.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelIndex Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 * \param[in]    inputClass   The input class to be assigned to the channel.
 *                            Range: \ref IfxEvadc_InputClasses
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setChannelInputClass(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_InputClasses inputClass);

/**
 * \brief Configures the limit check mode for a specific EVADC channel.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelIndex Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 * \param[in]    limitCheck   The limit check mode to set.
 *                            Range: \ref IfxEvadc_LimitCheck
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setChannelLimitCheckMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_LimitCheck limitCheck);

/**
 * \brief Configures the data modification mode for a specific result register of an EVADC group.
 *
 * \param[inout] evadcG          Pointer to the EVADC group registers.
 * \param[in]    resultRegister  The result register to configure.
 *                               Range: \ref  IfxEvadc_ChannelResult
 * \param[in]    mode            The data modification mode to set.
 *                               Range: \ref  IfxEvadc_DataModificationMode
 * 0b01 Result filtering mode.
 * 0b10 Difference mode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setDataModificationMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister, IfxEvadc_DataModificationMode mode);

/**
 * \brief Sets the data reduction control mode for a specific result register in an EVADC group.
 *
 * \param[inout] evadcG          Pointer to the EVADC group registers.
 * \param[in]    resultRegister  The result register to configure.
 *                               Range: \ref  IfxEvadc_ChannelResult
 * \param[in]    mode            The data modification mode to set.
 *                               Range: 0 to F
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setDataReductionControlMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister, uint32 mode);

/**
 * \brief Configures the FIFO mode for the specified result register of the EVADC group.
 *
 * \param[inout] evadcG         Pointer to the EVADC group registers.
 * \param[in]    resultRegister The result register to configure.
 *                              Range: \ref  IfxEvadc_ChannelResult
 * \param[in]    mode           FIFO mode configuration
 *                              Range: \ref  IfxEvadc_FifoMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFifoMode(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelResult resultRegister, IfxEvadc_FifoMode mode);

/**
 * \brief Configures the lower boundary for a specific channel within an EVADC group.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    channelIndex  Specifies the channel ID to be added to the queue.
 *                             Range: \ref IfxEvadc_ChannelId
 * \param[in]    lowerBoundary The boundary selection for the lower boundary.
 *                             Range: \ref IfxEvadc_BoundarySelection
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setLowerBoundary(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_BoundarySelection lowerBoundary);

/**
 * \brief Selects the reference input for the specified EVADC channel.
 *
 * \param[inout] evadcG       Pointer to the EVADC group registers.
 * \param[in]    channelIndex Specifies the channel ID to be added to the queue.
 *                            Range: \ref IfxEvadc_ChannelId
 * \param[in]    reference    The reference input to be selected for the channel.
 *                            Range: \ref IfxEvadc_ChannelReference
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setReferenceInput(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_ChannelReference reference);

/**
 * \brief Sets the result event node pointer 0 for the specified EVADC group.
 *
 * \param[inout] evadcG         Pointer to the EVADC group registers.
 * \param[in]    resultSrcNr    Service request node number to be assigned to the channel.
 *                              Range: \ref IfxEvadc_SrcNr
 * \param[in]    resultRegister The result register to configure.
 *                              Range: \ref  IfxEvadc_ChannelResult
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setResultNodeEventPointer0(Ifx_EVADC_G *evadcG, IfxEvadc_SrcNr resultSrcNr, IfxEvadc_ChannelResult resultRegister);

/**
 * \brief Configures the result event node pointer 1 for the specified EVADC group.
 *
 * \param[inout] evadcG         Pointer to the EVADC group registers.
 * \param[in]    resultSrcNr    Service request node number to be assigned to the channel.
 *                              Range: \ref IfxEvadc_SrcNr
 * \param[in]    resultRegister The result register to configure.
 *                              Range: \ref  IfxEvadc_ChannelResult
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setResultNodeEventPointer1(Ifx_EVADC_G *evadcG, IfxEvadc_SrcNr resultSrcNr, IfxEvadc_ChannelResult resultRegister);

/**
 * \brief Configures the result storage position alignment for the specified EVADC channel.
 *
 * \param[inout] evadcG              Pointer to the EVADC group registers.
 * \param[in]    channelIndex        Specifies the channel ID to be added to the queue.
 *                                   Range: \ref IfxEvadc_ChannelId
 * \param[in]    rightAlignedStorage Boolean flag to enable right-aligned storage.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setResultPosition(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, boolean rightAlignedStorage);

/**
 * \brief Configures the synchronization request for a specific channel within the EVADC group.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    channelIndex  Specifies the channel ID to be added to the queue.
 *                             Range: \ref IfxEvadc_ChannelId
 * \param[in]    synchonize    Boolean flag to enable or disable synchronization:
 *                             TRUE : Enable synchronization for the channel.
 *                             FALSE: Disable synchronization.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setSyncRequest(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, boolean synchonize);

/**
 * \brief Sets the upper boundary for a specific channel within an EVADC group.
 *
 * \param[inout] evadcG        Pointer to the EVADC group registers.
 * \param[in]    channelIndex  Specifies the channel ID to be added to the queue.
 *                             Range: \ref IfxEvadc_ChannelId
 * \param[in]    upperBoundary The selection for the upper boundary.
 *                             Range: \ref IfxEvadc_BoundarySelection
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setUpperBoundary(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_BoundarySelection upperBoundary);

/**
 * \brief Stores the result of a specific channel within the EVADC group.
 *
 * \param[inout] evadcG         Pointer to EVADC group registers.
 * \param[in]    channelIndex   Specifies the channel ID to be added to the queue.
 *                              Range: \ref IfxEvadc_ChannelId
 * \param[in]    resultRegister The result register to configure.
 *                              Range: \ref  IfxEvadc_ChannelResult
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_storeGroupResult(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channelIndex, IfxEvadc_ChannelResult resultRegister);

