Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

/** \addtogroup IfxLld_Evadc_Std_Emux
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Gets the global conversion mode for the specified input class.
 *
 * \param[in] evadc         Pointer to the base of EVADC module.
 * \param[in] inputClassNum The input class number for which to retrieve the noise reduction level.
 *                          Range: 0 and 1
 *
 * \retval IfxEvadc_ChannelNoiseReduction The noise reduction mode configured for the specified input class.
 *         Range: \ref IfxEvadc_ChannelNoiseReduction.
 */
IFX_INLINE IfxEvadc_ChannelNoiseReduction IfxEvadc_getEmuxGlobalConversionMode(Ifx_EVADC *evadc, uint8 inputClassNum);

/**
 * \brief Retrieves the external conversion mode for the specified ADC input class.
 *
 * \param[in] evadcG        Pointer to EVADC group registers.
 * \param[in] inputClassNum The input class number for which to retrieve the noise reduction level.
 *                          Range: 0 and 1
 *
 * \retval IfxEvadc_ChannelNoiseReduction The noise reduction mode configured for the specified input class.
 */
IFX_INLINE IfxEvadc_ChannelNoiseReduction IfxEvadc_getEmuxGroupConversionMode(Ifx_EVADC_G *evadcG, uint8 inputClassNum);

/**
 * \brief Gets the ADC input class sample time of an external channel.
 *
 * \param[in] evadcG          Pointer to EVADC group registers.
 * \param[in] inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                            Range: 0 and 1
 * \param[in] analogFrequency ADC module analog frequency in Hz.
 *
 * \retval float32 ADC input class external channel sample time in seconds.
 */
IFX_INLINE float32 IfxEvadc_getEmuxGroupSampleTime(Ifx_EVADC_G *evadcG, uint8 inputClassNum, float32 analogFrequency);

/**
 * \brief Configures the external conversion mode for the specified Global Input Class.
 *
 * \param[inout] evadc           Pointer to the base of EVADC module.
 * \param[in]    inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                               Range: 0 and 1
 * \param[in]    conversionMode  ADC conversion mode.
 *                               Range: \ref IfxEvadc_ChannelNoiseReduction
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setEmuxGlobalConversionMode(Ifx_EVADC *evadc, uint8 inputClassNum, IfxEvadc_ChannelNoiseReduction conversionMode);

/**
 * \brief Configures the sample time for the ADC global class for an external channel.
 *
 * \param[inout] evadc           Pointer to the base of EVADC module.
 * \param[in]    inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                               Range: 0 and 1
 * \param[in]    analogFrequency The ADC analog frequency in Hz.
 * \param[in]    sampleTime      The requested sample time for the input class in seconds.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setEmuxGlobalSampleTime(Ifx_EVADC *evadc, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/**
 * \brief Configures the conversion mode for external channel conversion of the specified ADC input class.
 *
 * \param[inout] evadcG         Pointer to EVADC group registers.
 * \param[in]    inputClassNum  The input class number for which to retrieve the noise reduction level.
 *                              Range: 0 and 1
 * \param[in]    conversionMode ADC conversion mode.
 *                              Range: \ref IfxEvadc_ChannelNoiseReduction
 *
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setEmuxGroupConversionMode(Ifx_EVADC_G *evadcG, uint8 inputClassNum, IfxEvadc_ChannelNoiseReduction conversionMode);

/**
 * \brief Sets the ADC input class sample time for external channel.
 * This function calculates and configures the necessary sample time for the specified ADC input class.
 *
 * \param[inout] evadcG          Pointer to EVADC group registers.
 * \param[in]    inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                               Range: 0 and 1
 * \param[in]    analogFrequency The ADC analog frequency in Hz.
 * \param[in]    sampleTime      The requested sample time for the input class in seconds.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setEmuxGroupSampletime(Ifx_EVADC_G *evadcG, uint8 inputClassNum, float32 analogFrequency, float32 sampleTime);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Configures the external multiplexer mode for the EVADC module.
 *
 * \param[inout] evadc                 Pointer to the base of EVADC module.
 * \param[inout] evadcG                Pointer to EVADC group registers.
 * \param[in]    mode                  External Multiplexer mode to be configured.
 *                                     Range: \ref IfxEvadc_ExternalMultiplexerMode
 * \param[in]    channels              Specifies the channel ID.
 *                                     Range: 0 to 15
 * \param[in]    startChannel          Specifies the external channel value from which conversion is to be carried out.
 *                                     Range: \ref IfxEvadc_EmuxSelectValue
 * \param[in]    code                  Specifies the output channel number coding scheme.
 *                                     Range: \ref IfxEvadc_EmuxCodingScheme
 * \param[in]    sampleTimeControl     Specifies when to use a sample time for the external channel.
 *                                     Range: \ref IfxEvadc_EmuxSampleTimeControl
 * \param[in]    channelSelectionStyle Specifies the external multiplexer channel selection style.
 *                                     Range: \ref IfxEvadc_ChannelSelectionStyle
 *
 * \retval None
 */
IFX_EXTERN void IfxEvadc_configExternalMultiplexerMode(Ifx_EVADC *evadc, Ifx_EVADC_G *evadcG, IfxEvadc_ExternalMultiplexerMode mode, uint8 channels, IfxEvadc_EmuxSelectValue startChannel, IfxEvadc_EmuxCodingScheme code, IfxEvadc_EmuxSampleTimeControl sampleTimeControl, IfxEvadc_ChannelSelectionStyle channelSelectionStyle);

