Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */

#if !defined(DEVICE_TC33XED) && !defined(DEVICE_TC33X) && !defined (DEVICE_TC35X)
/** \addtogroup IfxLld_Evadc_Std_FastCompare
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Configures the software control for the Boundary Flag in the Fast Compare module.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    control Action to be taken on the Boundary Flag (FCM.B.BFL).
 *                       Range: \ref IfxEvadc_BoundaryFlagSwControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareBoundaryFlagSwControl(Ifx_EVADC_FC *evadcFC, IfxEvadc_BoundaryFlagSwControl control);

/**
 * \brief Configures the Boundary Flag inversion setting for the Fast Compare module.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Controls the inversion of the Boundary Flag.
 *                       Range: \ref IfxEvadc_BoundaryFlagInversionControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareBoundaryFlagInversion(Ifx_EVADC_FC *evadcFC, IfxEvadc_BoundaryFlagInversionControl mode);

/**
 * \brief Disables the Fast Compare boundary flag for the specified EVADC instance.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operation.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disableFastCompareBoundaryFlag(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Enables the Fast Compare Boundary Flag for the specified EVADC Fast Compare instance.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operation.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableFastCompareBoundaryFlag(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Enable or disable sample timing synchronization for Fast Compare operations
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations
 * \param[in]    mode    Sample synchronization mode to be configured
 *                       Range: \ref IfxEvadc_SampleSynchronization
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableFastCompareSampleSynchronization(Ifx_EVADC_FC *evadcFC, IfxEvadc_SampleSynchronization mode);

/**
 * \brief Sets the reference precharge duration for the Fast Compare reference input FCCTRL.B.RPC.
 *
 * \param[inout] evadcFC  Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    duration Reference precharge control mode
 *                        Range: \ref IfxEvadc_ReferencePrechargeControl
 *
 * 0 - Precharge the reference input for 1 clock phase
 * 1 - Precharge the reference input for 1 clock period (2 phases)
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareReferencePrechargeDuration(Ifx_EVADC_FC *evadcFC, IfxEvadc_ReferencePrechargeControl duration);

/**
 * \brief Gets the status of the Fast Compare boundary flag.
 *
 * \param[in] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 *
 * \retval 0 (FALSE) Passive state : Result has not yet crossed the activation boundary, or selected gate signal is inactive, or this boundary flag is disabled.
 *         1 (TRUE)  Active state  : Result has crossed the activation boundary.
 */
IFX_INLINE boolean IfxEvadc_getFastCompareBoundaryFlagStatus(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Returns the current level status of the external trigger input for the Fast Compare module.
 *
 * \param[in] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 *
 * \retval TRUE  The external trigger level is high.
 *         FALSE The external trigger level is low.
 */
IFX_INLINE boolean IfxEvadc_getFastCompareExternalTriggerLevelStatus(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Checks the status of the Fast Compare operation result
 *
 * \param[in] evadcFC  Pointer to the EVADC register set for Fast Compare operations.
 *
 * \retval TRUE  Fast Compare condition has been met.
 *         FALSE Fast Compare condition has not been met.
 */
IFX_INLINE boolean IfxEvadc_getFastCompareResultStatus(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Checks if a new result is available in the Fast Compare Module (FCM) of the EVADC.
 *
 * \param[in] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 *
 * \retval TRUE   A new result is available in the FCM.B.FCR bit.
 *         FALSE  No new result is available in the FCM.B.FCR bit.
 */
IFX_INLINE boolean IfxEvadc_isFastCompareNewResultAvailable(Ifx_EVADC_FC *evadcFC);

/**
 * \brief Selects the behavior of the Boundary Flag (BFL) with respect to the value of FCR.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    The mode of Boundary Flag activation
 *                       Range: \ref IfxEvadc_BoundaryFlagActivationMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_selectFastCompareBoundaryFlagActivationMode(Ifx_EVADC_FC *evadcFC, IfxEvadc_BoundaryFlagActivationMode mode);

/**
 * \brief Selects the boundary flag node pointer for fast compare operations in the EVADC module.
 *
 * \param[inout] evadcFC     Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    nodePointer Boundary flag node pointer to be selected for the fast compare operation.
 *                           Range: \ref IfxEvadc_BoundaryFlagNodePointer
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_selectFastCompareBoundaryFlagNodePointer(Ifx_EVADC_FC *evadcFC, IfxEvadc_BoundaryFlagNodePointer nodePointer);

/**
 * \brief Sets the delay of the analog clock (in clock cycles) after the synchronization signal.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operation.
 * \param[in]    delay   Defines the delay of the analog clock in clock cycles after the synchronization signal.
 *                       Range: \ref IfxEvadc_FastCompareAnalogClockSynchronizationDelay
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareAnalogClockSynchronizationDelay(Ifx_EVADC_FC *evadcFC, IfxEvadc_FastCompareAnalogClockSynchronizationDelay delay);

/**
 * \brief Set Analog Converter Control modes
 *
 * \param[inout] evadcFC  Pointer to the EVADC register set for Fast Compare operation.
 * \param[ino]   mode     Analog Converter Control modes
 *                        Range: \ref IfxEvadc_FastCompareAnalogConverterControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareAnalogConverter(Ifx_EVADC_FC *evadcFC, IfxEvadc_FastCompareAnalogConverterControl mode);

/**
 * \brief Configures the analog input precharge control for Fast Compare operations.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Analog Input Precharge Control mode for Fast Compare operations.
 *                       Range: \ref IfxEvadc_AnalogInputPrechargeControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareAnalogInputPrechargeControl(Ifx_EVADC_FC *evadcFC, IfxEvadc_AnalogInputPrechargeControl mode);

/**
 * \brief Sets the Fast Compare Analog Internal Clock Divider to control the frequency of the analog converter clock.
 *
 * This function configures the divider factor for the Fast Compare Analog Internal Clock (fADCI),
 * which is derived from the peripheral clock (fADC) using the formula: fADCI = fADC / divider.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    divider Fast Compare Analog Internal Clock Divider factor. The divider can be set to values from 0 (max frequency) to 31 (fADC / 32).
 *                       Range: \ref IfxEvadc_ClockDividerFactor
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareAnalogInternalClockDivider(Ifx_EVADC_FC *evadcFC, IfxEvadc_ClockDividerFactor divider);

/**
 * \brief Sets the source of the value(s) in bitfield FCREF.
 *
 * \param[inout] evadcFC Pointer to EVADC register set for Fast Compare operation.
 * \param[in]    mode    Defines the source of the value(s) in bitfield FCREF.
 *                       Range: \ref IfxEvadc_FastCompareAutomaticUpdate
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareAutomaticUpdateMode(Ifx_EVADC_FC *evadcFC, IfxEvadc_FastCompareAutomaticUpdate mode);

/**
 * \brief Configures the event mode for the Fast Compare channel in the EVADC module.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Mode/criteria for generating service requests.
 *                       Range: \ref IfxEvadc_ChannelEventMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareChannelEventMode(Ifx_EVADC_FC *evadcFC, IfxEvadc_ChannelEventMode mode);

/**
 * \brief Configures the external trigger polarity for the Fast Compare operation.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    The external trigger polarity mode to be set.
 *                       Range: \ref IfxEvadc_ExternalTriggerPolarity
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareExternalTriggerPolarity(Ifx_EVADC_FC *evadcFC, IfxEvadc_ExternalTriggerPolarity mode);

/**
 * \brief Configures the Fast Compare Gate operating mode for the specified EVADC instance.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Operating mode for the Fast Compare Gate.
 *                       Range: \ref IfxEvadc_ExternalTriggerPolarity
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareGateOperatingMode(Ifx_EVADC_FC *evadcFC, IfxEvadc_GateOperatingMode mode);

/**
 * \brief Configures the ramp direction for the Fast Compare module.
 *
 * \param[inout] evadcFC       Pointer to EVADC register set for Fast Compare operation.
 * \param[in]    rampDirection Ramp direction setting.
 *                             Range: \ref IfxEvadc_ExternalTriggerPolarity
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareRampDirection(Ifx_EVADC_FC *evadcFC, IfxEvadc_RampDirection rampDirection);

/**
 * \brief Sets the reference value for fast comparison in the EVADC module.
 *
 * \param[inout] evadcFC        Pointer to EVADC register set for Fast Compare operation.
 * \param[in]    referenceValue The reference value to be used for comparison. The input signal level is compared against this value during fast compare operations.
 *                              Range: 0 to 0x3FF
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareReferenceValue(Ifx_EVADC_FC *evadcFC, uint16 referenceValue);

/**
 * \brief Configures the run mode of the fast compare channel.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operation.
 * \param[in]    mode    Run mode of the fast compare channel.
 *                       Range: \ref IfxEvadc_FastCompareRunControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareRunControl(Ifx_EVADC_FC *evadcFC, IfxEvadc_FastCompareRunControl mode);

/**
 * \brief Set the fast compare run ramp control for channel.
 *
 * \param[inout] evadcFC       Pointer to EVADC register set for Fast Compare operation
 * \param[in]    rampStartMode Defines the run conditions for the ramp generation
 *                             Range: \ref IfxEvadc_RampRunControl
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareRunRampControl(Ifx_EVADC_FC *evadcFC, IfxEvadc_RampRunControl rampStartMode);

/**
 * \brief Configures the additional sample time for the Fast Compare operation by setting the STCF field in the FCCTRL register.
 *
 * \param[inout] evadcFC          Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    additionalCycles Number of additional clock cycles to be added to the minimum sample phase of 2 analog clock cycles.
 *                                Range: 0 to 255.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareSampleTimeControl(Ifx_EVADC_FC *evadcFC, uint8 additionalCycles);

/**
 * \brief Sets the criteria for generating service requests in the Fast Compare module.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Defines the mode for service request generation.
 *                       Range: \ref IfxEvadc_FastCompareServiceRequestGeneration
 * 
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareServiceRequestGeneration(Ifx_EVADC_FC *evadcFC, IfxEvadc_FastCompareServiceRequestGeneration mode);

/**
 * \brief Sets the interval at which fast compare operations are triggered in steps of 16 * 1/f_ADC
 *
 * \param[inout] evadcFC  Pointer to EVADC register set for Fast Compare operation
 * \param[in]    interval Defines the interval at which fast compare operations are triggered in steps of 16 * 1/f_ADC.
 *                        Range: 0 to 0xFF
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareTriggerInterval(Ifx_EVADC_FC *evadcFC, uint8 interval);

/**
 * \brief Sets the trigger operating mode for the Fast Compare channel in the EVADC module.
 *
 * \param[inout] evadcFC Pointer to the EVADC register set for Fast Compare operations.
 * \param[in]    mode    Trigger operating mode to be configured.
 *                       Range: \ref IfxEvadc_TriggerOperatingMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setFastCompareTriggerOperatingMode(Ifx_EVADC_FC *evadcFC, IfxEvadc_TriggerOperatingMode mode);

