Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/iLLD/TC3xx/Tricore/Evadc/Std/IfxEvadc.h
/** \} */
#endif /*#if !defined(DEVICE_TC33XED) && !defined(DEVICE_TC33X) && !defined (DEVICE_TC35X)*/

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \brief Retrieves the analog function configuration of the specified EVADC group.
 *
 * \param[in] evadcG  Pointer to EVADC group registers.
 *
 * \retval Ifx_EVADC_G_ANCFG The analog function configuration value of the EVADC group.
 */
IFX_INLINE Ifx_EVADC_G_ANCFG IfxEvadc_getAnalogFunctionConfiguration(Ifx_EVADC_G *evadcG);

/**
 * \brief Calculates the sample time of ADC global class for an external channel.
 *
 * \param[in] evadc           Pointer to the base of EVADC module.
 * \param[in] inputClassNum   The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in] analogFrequency The analog frequency of the ADC module in Hz.
 *
 * \retval float32 The sample time of the ADC input class external channel in seconds.
 */
IFX_INLINE float32 IfxEvadc_getEmuxGlobalSampleTime(Ifx_EVADC *evadc, uint8 inputClassNum, float32 analogFrequency);

/**
 * \brief Configures the Emux Interface for a specific group in the EVADC module.
 *
 * \param[inout] evadc         Pointer to the base of EVADC module.
 * \param[in]    emuxInterface Specifies the Emux interface to be configured.
 *                             Range: \ref IfxEvadc_EmuxInterface
 * \param[in]    group         Group identifier for the EVADC instance to configure.
 *                             Range: \ref IfxEvadc_GroupId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setEmuxInterfaceForGroup(Ifx_EVADC *evadc, IfxEvadc_EmuxInterface emuxInterface, IfxEvadc_GroupId group);

/**
 * \brief Disables the reference precharge for the specified EVADC group.
 *
 * \param[inout] evadcG Pointer to EVADC group registers.
 * \param[in]    group  Group identifier for the EVADC instance to configure.
 *                      Range: \ref IfxEvadc_GroupId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disableReferencePrecharge(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group);

/**
 * \brief Disables the input buffer for the specified EVADC group.
 *
 * \param[inout] evadcG Pointer to EVADC group registers.
 * \param[in]    group  Group identifier for the EVADC instance to configure.
 *                      Range: \ref IfxEvadc_GroupId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_disableInputBuffer(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group);

/**
 * \brief Checks if the clock for the EVADC module is enabled.
 *
 * \param[in] evadc Pointer to the base of EVADC module.
 *
 * \retval TRUE   If the EVADC module's clock is enabled.
 *          FALSE If the EVADC module's clock is disabled.
 */
IFX_INLINE boolean IfxEvadc_isModuleEnabled(Ifx_EVADC *evadc);

/**
 * \brief Enables the startup calibration phase for the EVADC module.
 *
 * \param[inout] evadc Pointer to the base of EVADC module.
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_enableStartupCalibration(Ifx_EVADC *evadc);

/**
 * \brief Configures the gating mode for a specific request queue in the EVADC group.
 *
 * \param[inout] evadcG     Pointer to EVADC group registers.
 * \param[in]    queue      The request source queue to configure.
 *                          Range: \ref IfxEvadc_RequestSource
 * \param[in]    gatingMode The gating mode to apply to the specified queue.
 *                          Range: \ref IfxEvadc_GatingMode
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_selectQueueGatingMode(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource queue, IfxEvadc_GatingMode gatingMode);

/**
 * \brief Sets the channel number to be converted for the specified request queue.
 *
 * \param[inout] evadcG   Pointer to EVADC group registers.
 * \param[in]    queue    The request source queue to configure.
 *                        Range: \ref IfxEvadc_RequestSource
 * \param[in]    channel  Specifies the channel ID to be added to the queue.
 *                        Range: \ref IfxEvadc_ChannelId
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_setChannelRequest(Ifx_EVADC_G *evadcG, IfxEvadc_RequestSource queue, IfxEvadc_ChannelId channel);

/**
 * \brief Configures the global input class registers for the EVADC group, defining the sample time and data conversion mode.
 *
 * \param[inout] evadcG        Pointer to EVADC group registers.
 * \param[in]    inputClassNum The input class number for which to retrieve the noise reduction level.
 *                             Range: 0 and 1
 * \param[in]    value         Value to be written to the input class register.
 *                             Range: 0 to 0x7DF07DF
 *
 * \retval None
 */
IFX_INLINE void IfxEvadc_configureIclass(Ifx_EVADC_G *evadcG, uint8 inputClassNum, uint32 value);

/**
 * \brief Returns the pointer to the result register for the specified channel.
 *
 * \param[in] evadcG  Pointer to EVADC group registers.
 * \param[in] channel Specifies the channel ID to be added to the queue.
 *                    Range: \ref IfxEvadc_ChannelId
 *
 * \retval uint32 The address of the result register for the specified channel.
 */
IFX_INLINE volatile uint32 *IfxEvadc_getResultRegisterAddress(Ifx_EVADC_G *evadcG, IfxEvadc_ChannelId channel);

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE void IfxEvadc_setAnalogClockSynchronizationDelay(Ifx_EVADC_G *evadcG, IfxEvadc_GroupId group, IfxEvadc_AnalogClockSynchronizationDelay delay)
{
    IFX_UNUSED_PARAMETER(group);
#if defined(DEVICE_TC38EVOX) || defined(DEVICE_TC38X) || defined(DEVICE_TC39XB)
    evadcG->ANCFG.B.ACSD = delay;
#elif defined(DEVICE_TC33XED) || defined(DEVICE_TC35X)
    if (group < IFXEVADC_NUM_ADC_PRIMARY_GROUPS)
	{
		evadcG->ANCFG.B.ACSD = delay;
	}
	else
	{
		IFX_ASSERT(IFX_VERBOSE_LEVEL_WARNING, (group < IFXEVADC_NUM_ADC_PRIMARY_GROUPS)); /*Settings are only for Primary & Secondary groups*/
	}
#else
	if (((group < IFXEVADC_NUM_ADC_PRIMARY_GROUPS) || ((group > 7) && (group < (8 + IFXEVADC_NUM_ADC_SECONDARY_GROUPS)))))
	{
		evadcG->ANCFG.B.ACSD = delay;
	}
	else
	{
		IFX_ASSERT(IFX_VERBOSE_LEVEL_WARNING, ((group < IFXEVADC_NUM_ADC_PRIMARY_GROUPS) || (group > 7 && group < (8 + IFXEVADC_NUM_ADC_SECONDARY_GROUPS)))); /*Settings are only for Primary & Secondary groups*/
	}
#endif
}


